БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПулыНомеровЭЛН/ПулыНомеровЭЛН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПулыНомеровЭЛН</name>
  <resources>
    <name>ТекущийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияТекущегоНомера</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Закрыт</name>
    <comment>Пул больше не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочийКонтур</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НачалоДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПулыНомеровЭЛН/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийНомер = Запись.ТекущийНомер;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущийНомерПриИзменении(Элемент)
	
	Если	Запись.ТекущийНомер < Запись.НачалоДиапазона
		Или	Запись.ТекущийНомер > Запись.ОкончаниеДиапазона
	Тогда    
		ПоказатьПредупреждение( , "Введенный номер не входит в указанный диапазон!");
		Запись.ТекущийНомер = ТекущийНомер;
	Иначе
		ТекущийНомер = Запись.ТекущийНомер;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
